###  Part # 3
  #### Terraform Format and Style 🖌``
  #### Terraform Initialization ⚙️``
  #### Terraform Plan 📖``
  <details><summary>Show Plan</summary>
  ```

                       = "instance"%0A      + vpc_id                             = "vpc-01b99a788f3fe9022"%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 2%0A          + interval            = 30%0A          + matcher             = "200-299"%0A          + path                = "/"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 3%0A          + unhealthy_threshold = 2%0A        }%0A%0A      + stickiness {%0A          + cookie_duration = (known after apply)%0A          + cookie_name     = (known after apply)%0A          + enabled         = (known after apply)%0A          + type            = (known after apply)%0A        }%0A%0A      + target_failover {%0A          + on_deregistration = (known after apply)%0A          + on_unhealthy      = (known after apply)%0A        }%0A%0A      + target_health_state {%0A          + enable_unhealthy_connection_termination = (known after apply)%0A        }%0A    }%0A%0A  # aws_lb_target_group.tg2 will be created%0A  + resource "aws_lb_target_group" "tg2" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = (known after apply)%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancer_arns                 = (known after apply)%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_anomaly_mitigation  = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = "tg-2"%0A      + name_prefix                        = (known after apply)%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags                               = {%0A          + "App"   = "Web"%0A          + "Name"  = "Prod-tg-2"%0A          + "Owner" = "CAAacs730"%0A          + "env"   = "Prod"%0A        }%0A      + tags_all                           = {%0A          + "App"   = "Web"%0A          + "Name"  = "Prod-tg-2"%0A          + "Owner" = "CAAacs730"%0A          + "env"   = "Prod"%0A        }%0A      + target_type                        = "instance"%0A      + vpc_id                             = "vpc-01b99a788f3fe9022"%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 2%0A          + interval            = 30%0A          + matcher             = "200-299"%0A          + path                = "/"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 3%0A          + unhealthy_threshold = 2%0A        }%0A%0A      + stickiness {%0A          + cookie_duration = (known after apply)%0A          + cookie_name     = (known after apply)%0A          + enabled         = (known after apply)%0A          + type            = (known after apply)%0A        }%0A%0A      + target_failover {%0A          + on_deregistration = (known after apply)%0A          + on_unhealthy      = (known after apply)%0A        }%0A%0A      + target_health_state {%0A          + enable_unhealthy_connection_termination = (known after apply)%0A        }%0A    }%0A%0A  # aws_lb_target_group_attachment.tg1_attach[0] will be created%0A  + resource "aws_lb_target_group_attachment" "tg1_attach" {%0A      + id               = (known after apply)%0A      + port             = 80%0A      + target_group_arn = (known after apply)%0A      + target_id        = (known after apply)%0A    }%0A%0A  # aws_lb_target_group_attachment.tg1_attach[1] will be created%0A  + resource "aws_lb_target_group_attachment" "tg1_attach" {%0A      + id               = (known after apply)%0A      + port             = 80%0A      + target_group_arn = (known after apply)%0A      + target_id        = (known after apply)%0A    }%0A%0APlan: 12 to add, 0 to change, 6 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @udamad024, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform - Staging`*